{
  "title": "За мен",
  "generalInfo": " Аз съм човек с развито аналитично мислене. Умея да подреждам приоритети си и да спазвам срокове. Вярвам, че постигането на високи стандарти, е единственият правилен начин на работа. Активен и резултатно ориентиран. Винаги съм отворен за придобиване на нови знания и умения.",
  "contacts": {
    "title": "Контакти",
    "address": {
      "title": "Адрес",
      "address": "София, България"
    },
    "phone": "Телефон",
    "email": "Е-поща"
  },
  "skills": {
    "title": "Технологии"
  },
  "languages": {
    "title": "Езици",
    "en": "Английски",
    "bg": "Български"
  },
  "v-card": {
    "title": "Визитка",
    "scan-me": "Сканирай ме!"
  },
  "cv": {
    "title": "Свали CV"
  },
  "workHistory": {
    "title": "Трудов стаж",
    "jobs": {
      "fabrico": {
        "title": "Главен Програмист - `Front-End` - Софтуерът на корпоративно ниво",
        "employer": "Фабрико СааС ООД",
        "period": "2023 - до момента",
        "link": "https://www.fabrico.io/bg/",
        "description": [
          "Fabrico, елитно корпоративно решение, създадено от CHILDISH.AI, е специално предназначено за фабрики, които целят да повишат своите оперативни стандарти. Това е облачен CMMS, който наблюдава всички процеси на поддръжка в производствения завод, интегрирайки стратегии за поддръжка от начало до край по ефективен начин. Широко използван от различни производствени сектори, включително гиганти като ABB, Fabrico предлага инструменти за предварителна и реактивна поддръжка, допълнени от ефективна система за издаване на билети. Целта му е да преведе екипите от хартия на дигитален формат, като се гордее с лесна интеграция и удобен потребителски интерфейс. Обслужващ индустрии от автомобилната до минната, този универсален инструмент може да бъде достъпен от цял свят чрез уеб и мобилни платформи, гарантирайки сигурни, мощни и интуитивни операции за техническите екипи.",
          "Ежедневено писане на код със специфични програмни езици и технологии като: ",
          "React | Next.js | React Native | Redux | TypeScript | JavaScript | CSS3 | Sass | Tailwind | MUI | Bootstrap | HTML5 | React Testing Library | Git | Scrum | Linux"
        ]
      },
      "childish": {
        "title": "Главен Програмист 'Front-End - React (Next.js) | React Native (Expo) | TypeScript'",
        "employer": "CHILDISH.AI",
        "period": "2022 - 2023",
        "link": "https://childish.ai/",
        "description": [
          "Проектиране и разработване на нови или подобряване на стари функционалности за съществуващи софтуери.",
          "Предоставяне на техническа поддръжка за уеб приложения, системи и инфраструктура.",
          "Гарантира, че всички компоненти на приложението отговарят на функционалните и дизайн изисквания.",
          "Откриване и отстраняване на грешки в кода на нови и вече съществуващи софтуери.",
          "Тестване на нови функционалности, с цел гарантиране на качеството.",
          "Създаване на прототипи на нови приложения или функционалности за демонстриране на потенциална софтуера.",
          "Комуникация с клиенти или членове на екипа за изясняване на подробности относно целите и изискванията на проекта.",
          "Ежедневен преглед на нов код, за да се гарантира, че той отговаря всички стандарти и следва най-добрите практики.",
          "Използване на различни операционни системи.",
          "Ежедневено писане на код със специфични програмни езици и технологии като: ",
          "React | Next.js | React Native | Redux | TypeScript | JavaScript | CSS3 | Sass | Tailwind | MUI | Bootstrap | HTML5 | React Testing Library | Git | Scrum | Linux"
        ]
      },
      "atos": {
        "title": "Програмист 'Front-End - React'",
        "employer": "АТОС БЪЛГАРИЯ",
        "period": "2021 - 2022",
        "link": "https://atos.net/bg/bulgaria/atos-bulgaria-competency-center",
        "description": [
          "Разработка на 'Front-End' частта на софтуери за автоматизиране и подобряване на бизнес процесите на големи корпорации като Кока-Кола!",
          "JavaScript / React-Redux | CSS3 / Sass | HTML5",
          "Адаптивен дизайн за мобилни устройства",
          "Активно използване на система за контрол на версиите 'Git'",
          "Отлична комуникация с 'PM / QA' екипите",
          "Планиране на спринтове, използвайки 'Scrum' методология"
        ]
      },
      "neterra": {
        "title": "Програмист 'Front-End - Vue/jQuery'",
        "employer": "Нетера ЕООД",
        "period": "2019 - 2021",
        "link": "https://neterra.net",
        "description": [
          "Разработка на 'Front-End' частта на софтуер за планиране на корпоративни ресурси 'ERP'",
          "Разработване на фирмени Лендинг страници",
          "JavaScript/Vue | CSS/Sass | HTML",
          "Bootstrap | jQuery",
          "Адаптивен дизайн за мобилни устройства",
          "Активно използване на система за контрол на версиите 'Git'",
          "Отлична комуникация с 'QA' екипа",
          "Планиране на спринтове, използвайки 'Scrum' методология"
        ]
      },
      "walltopia": {
        "title": "Ръководител проекти | Ръководител отдел | Чертожник",
        "employer": "Уолтопия АД",
        "period": "2014 - 2019",
        "link": "https://walltopia.com",
        "pm": {
          "title": "Ръководител проекти",
          "time": "1г",
          "description": [
            "Цялостно организиране на времевата линия на проекта от началото до края",
            "Поддържане на постоянна връзка с клиентите",
            "Присъствие на мениджърски оперативки с изготвени доклади за свършена работа и план за изпълнение на предстоящата работа по проектите",
            "Заявяване и избор на транспорт за всички материали",
            "Подсигуряване на билети, квартири, автомобили и машини, нужни за групите от техници в различни страни",
            "На разположение за постоянна връзка с групите от техници 24/7",
            "Работа в динамична и мултикултурна среда"
          ]
        },
        "teamLead": {
          "title": "Ръководител отдел",
          "time": "3г",
          "description": [
            "Съставяне на работни графици и възлагане на задачи на служителите в отдела",
            "Ежеседмично присъствие на мениджърски оперативки с изготвени доклади за свършена работа и план за изпълнение на предстоящата работа на отдела",
            "Изготвяне на пълна техническа документация – производствени и монтажни чертежи съпроводени от подробни спецификации за производство, товарене и монтаж",
            "Качествен контрол на цялата продукция на отдела",
            "Мениджмънт на процесите – анализиране, автоматизиране и подобряване на работния процес с цел: увеличаване на производителността и намаляване на възможностите за грешки",
            "Изследователска и развойна дейност (R&D) - създаване на нови продукти и детайли. Внедряване на нови технологии и усъвършенстване на съществуващите такива. Провеждане на тестове и комуникация с международни лаборатории, с цел сертифициране на новите продукти",
            "Ежедневни консултации със служителите в отдела по належащи казуси в работата им",
            "В постоянна връзка с отделите: 'Инженеринг', 'Дизайн', 'Проджект мениджмънт', 'Логистика' и заводите на 'Walltopia', по въпроси касаещи настоящи и бъдещи обекти",
            "Постоянна работа със софтуери за дизайн, архитектура, инженеринг, администрация - като AutoCAD, AdvanceSteel, SketchUp, Excel, SAP и др."
          ]
        },
        "drafter": {
          "title": "Чертожник",
          "time": "1г",
          "description": [
            "Изготвяне на пълна техническа документация",
            "Изследователска и развойна дейност (R&D) - създаване на нови продукти и детайли",
            "Комуникация по проекти с чуждестранни клиенти и партньори на компанията",
            "Постоянна работа със софтуери за дизайн, архитектура, инженеринг, администрация - като AutoCAD, AdvanceSteel, SketchUp, Excel, SAP и др."
          ]
        }
      }
    }
  },
  "education": {
    "title": "Образование",
    "softUni": {
      "link": "https://about.softuni.bg/",
      "specialty": "'JavaScript' - уеб програмист",
      "period": "2018 - 2020",
      "university": "СофтУни"
    },
    "forestry": {
      "link": "https://ltu.bg/bg/",
      "specialty": "'Инженерен Дизайн' - Интериор и дизайн на мебели",
      "period": "2006 - 2010",
      "university": "Лесотехнически Университет"
    }
  },
  "certification": {
    "title": "Сертификати"
  }
}