{
  "title": "За мен",
  "generalInfo": " Аз съм човек с развито аналитично мислене. Умея да подреждам приоритети си и да спазвам срокове. Вярвам, че постигането на високи стандарти, е единственият правилен начин на работа. Активен и резултатно ориентиран. Винаги съм отворен за придобиване на нови знания и умения.",
  "contacts": {
    "title": "Контакти",
    "address": {
      "title": "Адрес",
      "address": "София, България"
    },
    "phone": "Телефон",
    "email": "Е-поща"
  },
  "skills": {
    "title": "Технологии"
  },
  "languages": {
    "title": "Езици",
    "en": "Английски",
    "bg": "Български"
  },
  "v-card": {
    "title": "Визитка",
    "scan-me": "Сканирай ме!"
  },
  "cv": {
    "title": "Свали CV"
  },
  "workHistory": {
    "title": "Трудов стаж",
    "jobs": {
        "eviden": {
          "title": "Старши Програмист - React | React Native - Софтуер корпоративно",
          "employer": "EVIDEN",
          "period": "2024 - Present",
          "link": "https://eviden.com/",
          "description": [
            "Разработване и поддръжка на големи и сложни кодови бази с модулни компоненти, следвайки най-добрите практики за чист код използвайки най-съвременните технологии за клиентски код като React, React Native/Expo и Next.js.",
            "Прилагане на решения за управление на временни обени от данни с Redux/RTK query за мащабируеми и високопроизводителни приложения.",
            "Използване на TypeScript и JavaScript (ES6+) за създаване на надежден, типизиран код.",
            "Проектиране на адаптивни и достъпни потребителски интерфейси с CSS3, Sass, Tailwind, MUI, Shadcn/ui и Blazor.",
            "Създаване на модулни компоненти, следвайки най-добрите практики в HTML5 и съвременните фронт-енд рамки.",
            "Гарантиране на качеството на кода с React Testing Library, Playwright и цялостно тестоване на приложенията.",
            "Прилагане на най-добрите практики за сигурност, включително защита срещу XSS атаки, CSRF уязвимости и процесите за удостоверяване на потребители.",
            "Участие в Agile/Scrum екипи, допринасяйки към планирането на спринтове, преглед на код и съдействие на по-младшите колегите в процеса на работа.",
            "Управление на версиите на кода с Git."
          ]
        },
        "nexo": {
          "title": "Старши Програмист - React | React Native - Крипто платформа",
          "employer": "Nexo",
          "period": "06.2024 - 09.2024",
          "link": "https://nexo.com/",
          "description": [
            "Използване на TypeScript и JavaScript за създаване на надеждни, мащабируеми и лесни за поддръжка кодови бази.",
            "Разработване и поддръжка на високопроизводителни, адаптивни уеб и мобилни приложения с React и React Native.",
            "Гарантиране на съответствие с уеб стандартите и най-добрите практики чрез HTML5 за кросбраузърна съвместимост и уеб достъпност.",
            "Извършване на цялостно тестване с React Testing Library и Playwright за поддържане на качеството и надеждността на кода.",
            "Ефективно сътрудничество с междуфункционални екипи в Scrum среда за създаване на иновативни маркетингови и бизнес интелигентни решения."
          ]
        },
        "fabrico": {
          "title": "Главен Програмист `Front-End` Софтуер корпоративно ниво",
          "employer": "Vector-labs / Fabrico",
          "period": "2022 - 2024",
          "link": "https://vector-labs.ai/ - https://www.fabrico.io/en/",
          "description": [
            "Проектиране и разработване на нови или подобряване на стари функционалности за съществуващи софтуери.",
            "Предоставяне на техническа поддръжка за уеб приложения, системи и инфраструктура.",
            "Гарантира, че всички компоненти на приложението отговарят на функционалните и дизайн изисквания.",
            "Откриване и отстраняване на грешки в кода на нови и вече съществуващи софтуери.",
            "Тестване на нови функционалности, с цел гарантиране на качеството.",
            "Създаване на прототипи на нови приложения или функционалности за демонстриране на потенциална софтуера.",
            "Комуникация с клиенти или членове на екипа за изясняване на подробности относно целите и изискванията на проекта.",
            "Ежедневен преглед на нов код, за да се гарантира, че той отговаря всички стандарти и следва най-добрите практики.",
            "Използване на различни операционни системи.",
            "Ежедневено писане на код със специфични програмни езици и технологии като: ",
            "React | Next.js | React Native | Redux | TypeScript | JavaScript | CSS3 | Sass | Tailwind | MUI | Bootstrap | HTML5 | React Testing Library | Git | Scrum | Linux"
          ]
        },
      "atos": {
        "title": "Програмист 'Front-End - React'",
        "employer": "АТОС БЪЛГАРИЯ",
        "period": "2021 - 2022",
        "link": "https://atos.net/bg/bulgaria/atos-bulgaria-competency-center",
        "description": [
          "Разработка на 'Front-End' частта на софтуери за автоматизиране и подобряване на бизнес процесите на големи корпорации като Кока-Кола!",
          "JavaScript / React-Redux | CSS3 / Sass | HTML5",
          "Адаптивен дизайн за мобилни устройства",
          "Активно използване на система за контрол на версиите 'Git'",
          "Отлична комуникация с 'PM / QA' екипите",
          "Планиране на спринтове, използвайки 'Scrum' методология"
        ]
      },
      "neterra": {
        "title": "Програмист 'Front-End' Vue.js | jQuery",
        "employer": "Нетера ЕООД",
        "period": "2019 - 2021",
        "link": "https://neterra.net",
        "description": [
          "Разработка на 'Front-End' частта на софтуер за планиране на корпоративни ресурси 'ERP'",
          "Разработване на фирмени Лендинг страници",
          "JavaScript/Vue | CSS/Sass | HTML",
          "Bootstrap | jQuery",
          "Адаптивен дизайн за мобилни устройства",
          "Активно използване на система за контрол на версиите 'Git'",
          "Отлична комуникация с 'QA' екипа",
          "Планиране на спринтове, използвайки 'Scrum' методология"
        ]
      },
      "walltopia": {
        "title": "Ръководител проекти | Ръководител отдел | Чертожник",
        "employer": "Уолтопия АД",
        "period": "2014 - 2019",
        "link": "https://walltopia.com",
        "pm": {
          "title": "Ръководител проекти",
          "time": "1г",
          "description": [
            "Цялостно организиране на времевата линия на проекта от началото до края",
            "Поддържане на постоянна връзка с клиентите",
            "Присъствие на мениджърски оперативки с изготвени доклади за свършена работа и план за изпълнение на предстоящата работа по проектите",
            "Заявяване и избор на транспорт за всички материали",
            "Подсигуряване на билети, квартири, автомобили и машини, нужни за групите от техници в различни страни",
            "На разположение за постоянна връзка с групите от техници 24/7",
            "Работа в динамична и мултикултурна среда"
          ]
        },
        "teamLead": {
          "title": "Ръководител отдел",
          "time": "3г",
          "description": [
            "Съставяне на работни графици и възлагане на задачи на служителите в отдела",
            "Ежеседмично присъствие на мениджърски оперативки с изготвени доклади за свършена работа и план за изпълнение на предстоящата работа на отдела",
            "Изготвяне на пълна техническа документация – производствени и монтажни чертежи съпроводени от подробни спецификации за производство, товарене и монтаж",
            "Качествен контрол на цялата продукция на отдела",
            "Мениджмънт на процесите – анализиране, автоматизиране и подобряване на работния процес с цел: увеличаване на производителността и намаляване на възможностите за грешки",
            "Изследователска и развойна дейност (R&D) - създаване на нови продукти и детайли. Внедряване на нови технологии и усъвършенстване на съществуващите такива. Провеждане на тестове и комуникация с международни лаборатории, с цел сертифициране на новите продукти",
            "Ежедневни консултации със служителите в отдела по належащи казуси в работата им",
            "В постоянна връзка с отделите: 'Инженеринг', 'Дизайн', 'Проджект мениджмънт', 'Логистика' и заводите на 'Walltopia', по въпроси касаещи настоящи и бъдещи обекти",
            "Постоянна работа със софтуери за дизайн, архитектура, инженеринг, администрация - като AutoCAD, AdvanceSteel, SketchUp, Excel, SAP и др."
          ]
        },
        "drafter": {
          "title": "Чертожник",
          "time": "1г",
          "description": [
            "Изготвяне на пълна техническа документация",
            "Изследователска и развойна дейност (R&D) - създаване на нови продукти и детайли",
            "Комуникация по проекти с чуждестранни клиенти и партньори на компанията",
            "Постоянна работа със софтуери за дизайн, архитектура, инженеринг, администрация - като AutoCAD, AdvanceSteel, SketchUp, Excel, SAP и др."
          ]
        }
      }
    }
  },
  "education": {
    "title": "Образование",
    "softUni": {
      "link": "https://about.softuni.bg/",
      "specialty": "'JavaScript' - уеб програмист",
      "period": "2018 - 2020",
      "university": "СофтУни"
    },
    "forestry": {
      "link": "https://ltu.bg/bg/",
      "specialty": "'Инженерен Дизайн' - Интериор и дизайн на мебели",
      "period": "2006 - 2010",
      "university": "Лесотехнически Университет"
    }
  },
  "certification": {
    "title": "Сертификати"
  }
}